probonopd/ESP8266HueEmulator/ESP8266HueEmulator/LightService.cpp
  int nextSlash = uri.indexOf("/");
  int groupNum = -1;
  String groupNumText;
  if (nextSlash == -1) {
    groupNumText = uri;
    uri = "";
  } else {
    groupNumText = uri.substring(0, nextSlash);
    uri = trimSlash(uri.substring(nextSlash));
  }
  groupNum = atoi(groupNumText.c_str()) - 1;
  if ((groupNum == -1 && groupNumText != "0") || groupNum >= 16 || (groupNum >= 0 && !lightGroups[groupNum])) {
    // error, invalid group number
    String resource = "/api/";
    resource += user;
    resource += "/groups/";
    resource += groupNumText;
    sendError(3, resource, "Invalid group number");
    return;
  }

  if (uri == "") {
    switch (HTTP.method()) {
      case HTTP_GET:
        if (groupNum != -1) {
          sendJson(lightGroups[groupNum]->getJson());
        } else {
          aJsonObject *object = aJson.createObject();
          aJson.addStringToObject(object, "name", "0");
          aJsonObject *lightsArray = aJson.createArray();
          aJson.addItemToObject(object, "lights", lightsArray);
          for (int i = 0; i < MAX_LIGHT_HANDLERS; i++) {
            if (!lightHandlers[i]) {
              continue;
            }
            // add light to list
            String lightNum = "";
            lightNum += (i + 1);
            aJson.addItemToArray(lightsArray, aJson.createItem(lightNum.c_str()));
          }
          sendJson(object);
        }
        break;
      case HTTP_PUT:
        // validate body, delete old group, create new group
        updateGroupSlot(groupNum, HTTP.arg("plain"));
        sendUpdated();
        break;
      case HTTP_DELETE: {
        updateGroupSlot(groupNum, "");
        String message = "/groups/";
        message += (groupNum + 1);
        message += " deleted";
        sendSuccess(message);
        break;
      }
      default:
        sendError(4, "/api/" + user + "/groups", "Group method not supported");
        break;
    }
    return;
  }

  if (uri == "action") {
    if (HTTP.method() != HTTP_PUT) {
      // error, only PUT allowed
      sendError(4, "/api/" + user + "/groups/" + groupNum + "/action", "Only PUT supported for groups/*/action");
      return;
    }
    // parse input as if for all lights
    unsigned int lightMask;
    if (groupNum == -1) {
      lightMask == 0xFFFF;
    } else {
      lightMask = lightGroups[groupNum]->getLightMask();
    }
    // apply to group
    applyConfigToLightMask(lightMask);
  }
}

LightGroup *lightScenes[16] = {nullptr, };

int findSceneIndex(String id) {
  int index = -1;
  for (int i = 0; i < 16; i++) {
    LightGroup *scene = lightScenes[i];
    if (scene) {
      if (scene->id == id) {
        return i;
      }
    } else if (index == -1) {
      index = i;
    }
  }
  return index;
}

bool updateSceneSlot(int slot, String id, String body) {
  aJsonObject *root;
  if (body != "") {
    Serial.print("JSON Body:");
    Serial.println(body);
    root = validateGroupCreateBody(body);
  }
  if (!root && body != "") {
    // throw error bad body
    sendError(2, "scenes/" + (slot + 1), "Bad JSON body");
    return true;
  }
  if (lightScenes[slot]) {
    delete lightScenes[slot];
    lightScenes[slot] = nullptr;
  }
  if (body != "") {
    lightScenes[slot] = new LightGroup(root);
    aJson.deleteItem(root);
  }
  return false;
}

void sceneCreationHandler(String id) {
  int sceneIndex = findSceneIndex(id);
  // handle scene creation
  // find first available scene slot
  if (sceneIndex == -1) {
    // throw error no new scenes allowed
    sendError(301, "scenes", "Scenes table full");
    return;
  }
  // updateSceneSlot sends failure messages
  if (!updateSceneSlot(sceneIndex, id, HTTP.arg("plain"))) {
    if (id == "") {
      id = String(sceneIndex);
    }
    lightScenes[sceneIndex]->id = id;
    sendSuccess("id", id);
    return;
  }
}

aJsonObject *getSceneJson() {
  // iterate over groups and serialize
  aJsonObject *root = aJson.createObject();
  for (int i = 0; i < 16; i++) {
    if (lightScenes[i]) {
      aJson.addItemToObject(root, lightScenes[i]->id.c_str(), lightScenes[i]->getSceneJson());
    }
  }
  return root;
}

void sceneListingHandler() {
  sendJson(getSceneJson());
}

LightGroup *findScene(String id) {
  for (int i = 0; i < 16; i++) {
    LightGroup *scene = lightScenes[i];
    if (scene) {
      if (scene->id == id) {
        return scene;
      }
    }
  }
  return nullptr;
}

void scenesHandler(String user, String uri) {
  uri = trimSlash(uri.substring(6));
  if (uri == "") {
    switch (HTTP.method()) {
      case HTTP_GET:
        sceneListingHandler();
        break;
      case HTTP_POST:
        sceneCreationHandler("");
        break;
      default:
        sendError(4, "/api/" + user + "/scenes", "Scene method not supported");
        break;
    }
    return;
  }

  int nextSlash = uri.indexOf("/");
  String sceneId;
  if (nextSlash == -1) {
    sceneId = uri;
    uri = "";
  } else {
    sceneId = uri.substring(0, nextSlash);
    uri = trimSlash(uri.substring(nextSlash));
  }
  LightGroup *scene = findScene(sceneId);

  if (uri == "") {
    switch (HTTP.method()) {
      case HTTP_GET:
        sendJson(scene->getSceneJson());
        break;
      case HTTP_PUT:
        // validate body, delete old group, create new group
        sceneCreationHandler(sceneId);
	      // XXX not a valid response according to API
        sendUpdated();
        break;
      case HTTP_DELETE: {
        if (scene) {
          updateSceneSlot(findSceneIndex(sceneId), sceneId, "");
        } else {
          sendError(3, "/scenes/"+sceneId, "Cannot delete scene that does not exist");
        }
        String message = "/scenes/";
        message += sceneId;
        message += " deleted";
        sendSuccess(message);
        break;
      }
      default: {
        String path = "/api/";
        path += user;
        path += "/scenes";
        sendError(4, path, "Scene method not supported");
        break;
      }
    }
    return;
  }

  if (uri.startsWith("lightstates/") || uri.startsWith("lights/")) {
    uri = uri.substring(12);
    if (HTTP.method() != HTTP_POST && HTTP.method() != HTTP_PUT) {
      // error, only POST allowed
      sendError(4, "/api/" + user + "/scenes/" + sceneId + "/lightstates", "Only PUT and POST supported for scenes/*/light*");
      return;
    }
    // XXX Do something with this information...
    // XXX not a valid response according to API
    sendUpdated();
  }
}

void wholeConfigHandler(String user, String uri) {
  // Serial.println("Respond with complete json as in https://github.com/probonopd/ESP8266HueEmulator/wiki/Hue-API#get-all-information-about-the-bridge");
  aJsonObject *root;
  root = aJson.createObject();
  // the default group 0 is never listed
  aJson.addItemToObject(root, "groups", getGroupJson());
  aJson.addItemToObject(root, "scenes", getSceneJson());
  aJsonObject *config;
  aJson.addItemToObject(root, "config", config = aJson.createObject());
  addConfigJson(config);
  aJsonObject *lights;
  aJson.addItemToObject(root, "lights", lights = aJson.createObject());
  addLightsJson(lights);
  aJsonObject *schedules;
  aJson.addItemToObject(root, "schedules", schedules = aJson.createObject());
  sendJson(root);
}

void descriptionHandler(String user, String uri) {
  WiFiClient client = HTTP.client();
  String str = "<root><specVersion><major>1</major><minor>0</minor></specVersion><URLBase>http://" + ipString + ":80/</URLBase><device><deviceType>urn:schemas-upnp-org:device:Basic:1</deviceType><friendlyName>Philips hue (" + ipString + ")</friendlyName><manufacturer>Royal Philips Electronics</manufacturer><manufacturerURL>http://www.philips.com</manufacturerURL><modelDescription>Philips hue Personal Wireless Lighting</modelDescription><modelName>Philips hue bridge 2012</modelName><modelNumber>929000226503</modelNumber><modelURL>http://www.meethue.com</modelURL><serialNumber>00178817122c</serialNumber><UDN>uuid:2f402f80-da50-11e1-9b23-00178817122c</UDN><presentationURL>index.html</presentationURL><iconList><icon><mimetype>image/png</mimetype><height>48</height><width>48</width><depth>24</depth><url>hue_logo_0.png</url></icon><icon><mimetype>image/png</mimetype><height>120</height><width>120</width><depth>24</depth><url>hue_logo_3.png</url></icon></iconList></device></root>";
  HTTP.send(200, "text/plain", str);
  Serial.println(str);
}

