probonopd/ESP8266HueEmulator/ESP8266HueEmulator/LightService.cpp
String methodToString(int method) {
  switch (method) {
    case HTTP_POST: return "POST";
    case HTTP_GET: return "GET";
    case HTTP_PUT: return "PUT";
    case HTTP_PATCH: return "PATCH";
    case HTTP_DELETE: return "DELETE";
    case HTTP_OPTIONS: return "OPTIONS";
    default: return "unknown";
  }
}

void handleAllOthers() {
  Serial.print("=== ");
  Serial.println(millis());
  Serial.print("Method: ");
  Serial.println(methodToString(HTTP.method()));
  String fullUri = trimSlash(HTTP.uri());
  Serial.print("requestedUri: ");
  Serial.println(fullUri);

  if (fullUri == "description.xml") {
    descriptionHandler("", fullUri);
    Serial.println(millis());
    return;
  }

  // make sure /api is there, rip it off along with trailing slash if present
  if (!fullUri.startsWith("api")) {
    // bail, unimplemented
    HTTP.send(200, "text/plain", "{}");
    Serial.println("FIXME: To be implemented");
    return;
  }
  fullUri.remove(0, 3);
  fullUri = trimSlash(fullUri);
  // get user
  String user;
  int userEnd = fullUri.indexOf('/');
  if (userEnd == -1) {
    user = fullUri;
    fullUri = "";
  } else {
    user = fullUri.substring(0, userEnd);
    fullUri.remove(0, userEnd);
  }
  String requestedUri = trimSlash(fullUri);
  if (requestedUri.endsWith("/")) {
    requestedUri = requestedUri.substring(0, requestedUri.length() - 1);
  }
  // requestedUri is remaining path, no leading or trailing slash
  Serial.print("URI: ");
  Serial.println(requestedUri);

  if ( requestedUri == "config" || (requestedUri == "" && user == "config") ) {
    configHandler(user, requestedUri);
  } else if (requestedUri == "") {
    if (user == "") {
      authHandler(user, requestedUri);
    } else {
      wholeConfigHandler(user, requestedUri);
    }
  } else if (requestedUri.startsWith("lights")) {
    lightsHandler(user, requestedUri);
  } else if (requestedUri.startsWith("groups")) {
    groupsHandler(user, requestedUri);
  } else if (requestedUri.startsWith("scenes")) {
    scenesHandler(user, requestedUri);
  } else {
    HTTP.send(200, "text/plain", "()");
    Serial.println("FIXME: To be implemented");

    // Print what the client has POSTed
    for (uint8_t i = 0; i < HTTP.args(); i++) Serial.printf("ARG[%u]: %s=%s\n", i, HTTP.argName(i).c_str(), HTTP.arg(i).c_str());
  }
  Serial.println(millis());
}

